app/views/meals/_meal.json.jbuilder


json.update_url meal_path(meal, method: :patch)
---
UPDATE "meals" SET "start" = ?, "end" = ?, "updated_at" = ? WHERE "meals"."id" = ?  [["start", 2017-01-10 00:00:00 UTC], ["end", 2017-01-11 00:00:00 UTC], ["updated_at", 2017-01-24 19:44:11 UTC], ["id", 4]]