app/controllers/meals_controller.rb

  def index
    @meals = Meal.where(start: params[:start]..params[:end])
---
SELECT "meals".* FROM "meals" WHERE ("meals"."start" BETWEEN ? AND ?)  [["start", "2017-01-01"], ["start", "2017-02-12"]]

  def create
    @meal = Meal.new(meal_params)
    @meal.save
---
INSERT INTO "meals" ("title", "start", "end", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Recipe 1"], ["start", 2017-01-04 00:00:00 UTC], ["end", 2017-01-05 00:00:00 UTC], ["created_at", 2017-01-24 19:01:29 UTC], ["updated_at", 2017-01-24 19:01:29 UTC]]

  def update
    @meal.update(meal_params)
---
UPDATE "meals" SET "start" = ?, "end" = ?, "updated_at" = ? WHERE "meals"."id" = ?  [["start", 2017-01-10 00:00:00 UTC], ["end", 2017-01-11 00:00:00 UTC], ["updated_at", 2017-01-24 19:44:11 UTC], ["id", 4]]

  def destroy
    @meal.destroy
---
DELETE FROM "meals" WHERE "meals"."id" = ?  [["id", 1]]

    def set_meal
      @meal = Meal.find(params[:id])
---
SELECT  "meals".* FROM "meals" WHERE "meals"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]